[
{"sku": "LAP-001", "name": "ProBook Ultra 15", "price": 1299.99, "quantityOnHand": 250, "description": "Professional-grade ultrabook laptop with Intel Core i7 processor and 16GB DDR5 RAM. Engineered for business productivity with all-day battery life and a lightweight aluminum chassis. Features a crisp 15.6-inch IPS display ideal for spreadsheets, presentations, and video conferencing."},
{"sku": "LAP-002", "name": "GameForce RTX Pro", "price": 2499.99, "quantityOnHand": 120, "description": "High-performance gaming laptop with RTX 4080 graphics and 32GB DDR5 RAM. Designed for competitive esports and AAA titles with a 240Hz display. Includes advanced cooling system for sustained performance during marathon gaming sessions."},
{"sku": "LAP-003", "name": "CodeStation Dev 14", "price": 1799.99, "quantityOnHand": 180, "description": "Developer-focused laptop with 64GB RAM and a fast NVMe SSD for compiling large codebases. Features a high-resolution 14-inch display with accurate color reproduction. Built for software engineers who need powerful local development environments and containerized workflows."},
{"sku": "LAP-004", "name": "ThinEdge Air 13", "price": 999.99, "quantityOnHand": 400, "description": "Ultra-thin lightweight laptop weighing just 2.2 pounds with a fanless design for silent operation. Perfect for students and frequent travelers who prioritize portability over raw power. Offers 14 hours of battery life and rapid USB-C charging."},
{"sku": "LAP-005", "name": "CreatorVision 16", "price": 2199.99, "quantityOnHand": 150, "description": "Creative professional laptop with 4K OLED display calibrated for DCI-P3 color accuracy. Ideal for video editing, graphic design, and 3D rendering workflows. Equipped with 32GB RAM and dedicated NVIDIA Studio GPU for accelerated creative applications."},
{"sku": "LAP-006", "name": "BudgetBook Essentials", "price": 449.99, "quantityOnHand": 800, "description": "Affordable everyday laptop for web browsing, email, and basic office productivity. Features a comfortable full-size keyboard and 256GB SSD storage. A reliable choice for home users and students on a budget who need a dependable daily driver."},
{"sku": "LAP-007", "name": "RuogedField X1", "price": 1899.99, "quantityOnHand": 90, "description": "Military-grade rugged laptop built to MIL-STD-810H standards for extreme environments. Water-resistant, dust-proof, and drop-tested for field operations and industrial use. Features a sunlight-readable display and hot-swappable battery for uninterrupted work in harsh conditions."},
{"sku": "LAP-008", "name": "ChromeFleet Enterprise", "price": 599.99, "quantityOnHand": 600, "description": "Enterprise ChromeOS laptop with centralized fleet management and zero-touch enrollment. Designed for corporate IT departments deploying hundreds of managed endpoints. Offers fast boot times, automatic updates, and seamless Google Workspace integration."},
{"sku": "LAP-009", "name": "DataSci Workstation 17", "price": 2999.99, "quantityOnHand": 75, "description": "Data science workstation laptop with 128GB RAM and dual NVMe SSDs in RAID 0 configuration. Optimized for machine learning training, large dataset analysis, and statistical modeling. Features an NVIDIA A-series GPU for CUDA-accelerated deep learning frameworks."},
{"sku": "LAP-010", "name": "EduBook Classroom", "price": 349.99, "quantityOnHand": 1000, "description": "Durable education laptop designed for K-12 classroom environments with a spill-resistant keyboard. Features a reinforced rubber bumper and easy-to-service modular components. Managed through school IT systems with parental controls and content filtering built in."},
{"sku": "LAP-011", "name": "HybridFlex 360", "price": 1099.99, "quantityOnHand": 300, "description": "Convertible 2-in-1 laptop with a 360-degree hinge for tent, tablet, and laptop modes. Includes a precision stylus pen for digital note-taking and sketching. Perfect for professionals who switch between presentations, creative work, and traditional typing throughout the day."},
{"sku": "LAP-012", "name": "SecureNode Gov Edition", "price": 1599.99, "quantityOnHand": 100, "description": "Government-certified laptop with TPM 2.0, hardware-encrypted SSD, and FIPS 140-2 compliance. Built for handling classified and sensitive data with tamper-evident seals. Includes a built-in smart card reader and privacy screen for secure workspaces."},
{"sku": "PER-001", "name": "ErgoType Mechanical KB", "price": 149.99, "quantityOnHand": 500, "description": "Ergonomic split mechanical keyboard with Cherry MX Brown switches and adjustable tenting. Designed to reduce wrist strain during extended typing sessions for developers and writers. Features programmable macro keys and USB-C connectivity with N-key rollover."},
{"sku": "PER-002", "name": "PrecisionTrack Wireless Mouse", "price": 79.99, "quantityOnHand": 800, "description": "High-precision wireless mouse with 25,000 DPI optical sensor and ergonomic sculpted grip. Optimized for both productivity workflows and casual gaming with customizable buttons. Offers dual Bluetooth and 2.4GHz connectivity with 70 hours of battery life."},
{"sku": "PER-003", "name": "StreamDeck Controller Pro", "price": 249.99, "quantityOnHand": 200, "description": "Programmable streaming controller with 15 customizable LCD keys for live streaming and content creation. Integrates with OBS, Twitch, and YouTube for one-touch scene switching and audio control. Essential peripheral for streamers and video producers managing complex broadcast setups."},
{"sku": "PER-004", "name": "UltraScan 4K Webcam", "price": 199.99, "quantityOnHand": 350, "description": "Professional 4K webcam with auto-focus and AI-powered background blur for video conferencing. Features a built-in ring light with adjustable color temperature for optimal lighting. Ideal for remote workers and content creators who need studio-quality video on every call."},
{"sku": "PER-005", "name": "SwiftPrint Laser Pro", "price": 399.99, "quantityOnHand": 150, "description": "High-speed color laser printer with duplex printing and 50-sheet automatic document feeder. Prints up to 30 pages per minute with crisp text and vibrant graphics. Designed for small office environments that need reliable high-volume document output."},
{"sku": "PER-006", "name": "DigiPad Artist Tablet", "price": 329.99, "quantityOnHand": 250, "description": "Professional pen tablet with 8192 levels of pressure sensitivity and tilt recognition for digital art. Compatible with Photoshop, Illustrator, and other creative applications. A must-have peripheral for illustrators, designers, and digital painters who demand precision."},
{"sku": "PER-007", "name": "KeyGlide Low-Profile KB", "price": 89.99, "quantityOnHand": 600, "description": "Slim low-profile wireless keyboard with scissor switches and backlit keys for comfortable typing. Features a compact 75% layout that saves desk space while retaining function keys. Perfect for minimalist setups and professionals who prefer a quiet, responsive keystroke."},
{"sku": "PER-008", "name": "TrackMaster Ergonomic Trackball", "price": 59.99, "quantityOnHand": 400, "description": "Ergonomic trackball mouse that eliminates wrist movement for reduced repetitive strain injury risk. Features a large ball with precision bearings and customizable button mapping. Recommended by ergonomics consultants for users who spend 8+ hours daily at their workstation."},
{"sku": "PER-009", "name": "DualView KVM Switch", "price": 129.99, "quantityOnHand": 300, "description": "4-port KVM switch supporting dual 4K displays with seamless keyboard and mouse sharing between computers. Enables developers and IT professionals to control multiple workstations from a single peripheral set. Features hotkey switching and USB 3.0 hub passthrough."},
{"sku": "PER-010", "name": "BioLock Fingerprint Scanner", "price": 49.99, "quantityOnHand": 700, "description": "USB fingerprint reader with 360-degree recognition and encrypted biometric storage for secure login. Compatible with Windows Hello and FIDO2 passwordless authentication standards. A compact security peripheral that replaces password entry with a single touch."},
{"sku": "PER-011", "name": "DocScan Portable Scanner", "price": 179.99, "quantityOnHand": 200, "description": "Compact portable document scanner with automatic duplex scanning at 25 pages per minute. Creates searchable PDFs with built-in OCR for digitizing paper documents and receipts. Ideal for mobile professionals and small businesses going paperless."},
{"sku": "PER-012", "name": "NumPad Pro Wireless", "price": 39.99, "quantityOnHand": 900, "description": "Wireless numeric keypad with mechanical switches for accountants and data entry specialists. Features a built-in calculator mode and programmable shortcut keys for spreadsheet navigation. Connects via Bluetooth to pair with compact keyboards that lack a number pad."},
{"sku": "STO-001", "name": "VaultDrive 4TB NVMe SSD", "price": 349.99, "quantityOnHand": 300, "description": "High-capacity 4TB NVMe M.2 SSD with sequential read speeds up to 7,000 MB/s. Designed for content creators and data professionals who need massive fast storage for video editing. Features hardware encryption and a 5-year warranty for reliable long-term data storage."},
{"sku": "STO-002", "name": "SpeedCache 2TB SATA SSD", "price": 129.99, "quantityOnHand": 600, "description": "Reliable 2TB SATA SSD for upgrading older laptops and desktops with dramatically faster boot and load times. Uses 3D NAND flash technology for endurance up to 2,400 TBW. An affordable storage upgrade that transforms system responsiveness for everyday computing."},
{"sku": "STO-003", "name": "CloudVault NAS 8-Bay", "price": 899.99, "quantityOnHand": 80, "description": "8-bay network-attached storage enclosure with dual 10GbE ports for high-speed data access across your network. Supports RAID 0, 1, 5, 6, and 10 configurations for flexible data protection strategies. Ideal for small businesses and creative studios that need centralized shared storage."},
{"sku": "STO-004", "name": "PortableVault 5TB USB-C", "price": 149.99, "quantityOnHand": 500, "description": "Rugged portable 5TB external hard drive with USB-C connectivity and hardware AES-256 encryption. Drop-resistant up to 4 feet with a shock-absorbing silicone shell for mobile professionals. Perfect for backing up large media libraries and transporting data between locations."},
{"sku": "STO-005", "name": "FlashStick 256GB USB Drive", "price": 29.99, "quantityOnHand": 2000, "description": "Compact 256GB USB 3.2 flash drive with read speeds up to 400 MB/s in a keychain-sized form factor. Features a retractable connector that eliminates lost caps for convenient everyday storage. A reliable pocket-sized solution for transferring files between computers."},
{"sku": "STO-006", "name": "ArchiveMax 16TB HDD", "price": 279.99, "quantityOnHand": 200, "description": "High-capacity 16TB hard drive engineered for NAS and archival storage with CMR recording technology. Rated for 24/7 operation with vibration-dampening features for multi-drive enclosures. Cost-effective mass storage solution for backups, surveillance, and cold data archives."},
{"sku": "STO-007", "name": "MicroVault 1TB SD Card", "price": 89.99, "quantityOnHand": 800, "description": "Ultra-fast 1TB microSD card with V30 speed class for 4K video recording and burst photography. Compatible with drones, action cameras, and smartphones that demand high write speeds. Includes a full-size SD adapter for seamless transfer to laptops and card readers."},
{"sku": "STO-008", "name": "RaidBox Thunderbolt Array", "price": 1499.99, "quantityOnHand": 50, "description": "Thunderbolt 4 RAID storage array with four NVMe bays delivering sustained 5,000 MB/s throughput. Purpose-built for video editors working with 8K RAW footage and multi-stream timelines. Features a near-silent cooling system and macOS/Windows Time Machine backup compatibility."},
{"sku": "STO-009", "name": "BackupStation Cloud Gateway", "price": 599.99, "quantityOnHand": 100, "description": "Hybrid cloud storage gateway that automatically tiers data between local NVMe cache and cloud object storage. Provides seamless access to cloud-stored files as if they were on a local network drive. Designed for businesses implementing a 3-2-1 backup strategy with off-site redundancy."},
{"sku": "STO-010", "name": "M.2 Enclosure Thunderbolt", "price": 69.99, "quantityOnHand": 500, "description": "Thunderbolt M.2 NVMe enclosure that converts internal SSDs into blazing-fast portable external storage. Aluminum heat-sink design keeps drives cool under sustained transfer loads. A versatile storage accessory for repurposing spare drives or creating high-speed portable workspaces."},
{"sku": "STO-011", "name": "TapeLib LTO-9 Drive", "price": 2499.99, "quantityOnHand": 50, "description": "LTO-9 tape drive with 18TB native capacity per cartridge for enterprise-grade archival storage. Offers the lowest cost-per-terabyte for long-term data retention and regulatory compliance. Used by data centers, healthcare, and financial institutions for decades-long data preservation."},
{"sku": "NET-001", "name": "MeshMax WiFi 7 Router", "price": 349.99, "quantityOnHand": 250, "description": "Tri-band WiFi 7 mesh router system with 10Gbps aggregate throughput and multi-link operation. Covers up to 6,000 square feet with seamless roaming and band steering for connected homes. Features advanced QoS for prioritizing video conferencing, gaming, and streaming traffic."},
{"sku": "NET-002", "name": "GigaSwitch 24-Port Managed", "price": 299.99, "quantityOnHand": 150, "description": "24-port gigabit managed network switch with 4 SFP+ uplink ports for 10GbE backbone connectivity. Supports VLANs, link aggregation, and SNMP monitoring for enterprise network segmentation. Built for small-to-medium office deployments requiring reliable wired infrastructure."},
{"sku": "NET-003", "name": "SecureGate VPN Firewall", "price": 499.99, "quantityOnHand": 100, "description": "Hardware VPN firewall with intrusion detection, deep packet inspection, and site-to-site tunnel support. Protects networks with stateful inspection and threat intelligence feeds updated hourly. Essential networking security appliance for businesses handling sensitive customer data and transactions."},
{"sku": "NET-004", "name": "PowerLine 2000 Adapter Kit", "price": 79.99, "quantityOnHand": 400, "description": "Powerline networking adapter pair delivering up to 2,000 Mbps over existing electrical wiring. Provides reliable wired network connectivity to rooms where WiFi signal is weak or unreliable. Simple plug-and-play setup with built-in pass-through power outlet and encryption."},
{"sku": "NET-005", "name": "WiFi 6E Access Point", "price": 229.99, "quantityOnHand": 300, "description": "Enterprise-grade WiFi 6E ceiling-mount access point supporting up to 200 concurrent client devices. Features 6GHz band access for interference-free high-bandwidth wireless connectivity. Ideal for offices, classrooms, and conference rooms with dense device concentrations."},
{"sku": "NET-006", "name": "TravelRouter Pocket VPN", "price": 59.99, "quantityOnHand": 600, "description": "Pocket-sized travel router with built-in WireGuard VPN client for secure connectivity on public WiFi. Creates a private wireless network from hotel or coffee shop internet connections. Compact networking solution for business travelers and digital nomads who need security on the go."},
{"sku": "NET-007", "name": "10GbE PCIe Network Card", "price": 129.99, "quantityOnHand": 200, "description": "PCIe 3.0 x4 network interface card with dual 10GbE RJ-45 ports for high-speed server connectivity. Supports jumbo frames, TCP/UDP offload, and SR-IOV for virtualized network environments. A critical networking upgrade for NAS systems, workstations, and home lab servers."},
{"sku": "NET-008", "name": "PoE Injector 8-Port Rack", "price": 189.99, "quantityOnHand": 150, "description": "8-port 802.3at/af Power over Ethernet injector providing up to 30W per port for IP cameras and access points. Rack-mountable design with surge protection and per-port status LEDs. Simplifies network infrastructure deployment by delivering power and data over a single Ethernet cable."},
{"sku": "NET-009", "name": "Fiber Media Converter SFP+", "price": 89.99, "quantityOnHand": 300, "description": "SFP+ fiber-to-copper media converter for bridging 10GbE fiber optic and RJ-45 network segments. Supports both single-mode and multi-mode fiber with auto-negotiation and link pass-through. Essential networking component for campus networks transitioning between fiber backbone and copper endpoints."},
{"sku": "NET-010", "name": "NetMonitor Traffic Analyzer", "price": 199.99, "quantityOnHand": 100, "description": "Portable network traffic analyzer with deep packet capture and real-time bandwidth monitoring. Identifies network bottlenecks, rogue devices, and security anomalies with an intuitive dashboard. An indispensable diagnostic networking tool for IT administrators and network engineers."},
{"sku": "NET-011", "name": "Outdoor WiFi Bridge 5km", "price": 159.99, "quantityOnHand": 150, "description": "Point-to-point outdoor wireless bridge with 5km range and IP67 weatherproof enclosure. Delivers up to 867 Mbps throughput for connecting remote buildings and outbuildings to the main network. Features directional antennas and pole-mount hardware for rapid outdoor deployment."},
{"sku": "AUD-001", "name": "StudioPro Reference Headphones", "price": 299.99, "quantityOnHand": 200, "description": "Open-back reference headphones with planar magnetic drivers for flat, accurate audio reproduction. Engineered for professional audio mixing, mastering, and critical listening in studio environments. Delivers exceptional soundstage and detail resolution across the full frequency spectrum."},
{"sku": "AUD-002", "name": "NoiseShield ANC Earbuds", "price": 179.99, "quantityOnHand": 500, "description": "True wireless earbuds with adaptive active noise cancellation and transparency mode for ambient awareness. Provides up to 8 hours of playback with deep bass response and crystal-clear audio. Perfect for commuters and office workers who need immersive audio in noisy environments."},
{"sku": "AUD-003", "name": "PodCaster USB Microphone", "price": 149.99, "quantityOnHand": 350, "description": "Professional USB condenser microphone with cardioid pickup pattern and built-in pop filter for podcasting. Features zero-latency headphone monitoring and gain control for real-time audio adjustment. Ideal for podcasters, voice-over artists, and content creators recording from a home studio."},
{"sku": "AUD-004", "name": "BoomBox Bluetooth Speaker", "price": 129.99, "quantityOnHand": 400, "description": "Portable waterproof Bluetooth speaker with 360-degree audio and 20-hour battery life. Delivers rich bass and clear highs with IPX7 water resistance for pool and beach use. Rugged audio solution for outdoor adventures, barbecues, and casual listening anywhere."},
{"sku": "AUD-005", "name": "MixBoard USB Audio Interface", "price": 199.99, "quantityOnHand": 200, "description": "Professional 2-in/2-out USB audio interface with class-A preamps and 24-bit/192kHz recording capability. Low-latency performance for real-time monitoring during vocal and instrument recording sessions. An essential audio production tool for home studios and mobile recording setups."},
{"sku": "AUD-006", "name": "ConferenceHub Speakerphone", "price": 249.99, "quantityOnHand": 150, "description": "AI-powered conference speakerphone with 360-degree microphone array and echo cancellation. Picks up voices clearly from up to 15 feet away with automatic speaker tracking. Designed for meeting rooms and huddle spaces where clear audio communication is critical."},
{"sku": "AUD-007", "name": "GameComm 7.1 Headset", "price": 99.99, "quantityOnHand": 600, "description": "Virtual 7.1 surround sound gaming headset with detachable noise-canceling boom microphone. Lightweight memory foam ear cushions provide comfort during extended gaming sessions. Features on-ear controls and RGB lighting for competitive esports and immersive audio gaming experiences."},
{"sku": "AUD-008", "name": "DAC Pro Hi-Res Amplifier", "price": 169.99, "quantityOnHand": 250, "description": "Portable hi-res digital-to-analog converter and headphone amplifier supporting MQA and DSD256 formats. Drives high-impedance audiophile headphones with clean, powerful output up to 600 ohms. Elevates audio quality from laptops, phones, and digital music players for discerning listeners."},
{"sku": "AUD-009", "name": "StageMonitor Active Speaker Pair", "price": 449.99, "quantityOnHand": 100, "description": "Pair of powered studio monitor speakers with 5-inch woven Kevlar drivers and front-ported bass reflex design. Delivers flat frequency response for accurate mixing and mastering in near-field listening positions. Professional audio monitors trusted by music producers and sound engineers."},
{"sku": "AUD-010", "name": "WirelessMic Lavalier System", "price": 219.99, "quantityOnHand": 200, "description": "Dual-channel wireless lavalier microphone system with 200-foot range and 24-bit digital transmission. Clips discreetly to clothing for hands-free audio capture during interviews, presentations, and vlogging. Compact audio capture solution with real-time monitoring and auto-pairing receiver."},
{"sku": "AUD-011", "name": "SoundBar Home Theater", "price": 349.99, "quantityOnHand": 150, "description": "Dolby Atmos soundbar with wireless subwoofer and rear satellite speakers for immersive home theater audio. Creates a cinematic spatial audio experience with upward-firing height channels. Streams wirelessly from TVs, phones, and tablets via HDMI eARC, Bluetooth, and WiFi."},
{"sku": "ACC-001", "name": "LaptopStand Adjustable Riser", "price": 49.99, "quantityOnHand": 700, "description": "Adjustable aluminum laptop stand with six height positions for improved ergonomic posture. Elevates the screen to eye level to reduce neck strain during long work sessions. Features an open-air design with ventilation slots that help keep laptops cool under load."},
{"sku": "ACC-002", "name": "CableHub USB-C Dock 12-in-1", "price": 89.99, "quantityOnHand": 400, "description": "12-in-1 USB-C docking station with dual HDMI, Ethernet, SD card reader, and 100W power delivery. Transforms a single laptop USB-C port into a complete desktop workstation setup. Essential desk accessory for professionals using USB-C laptops with multiple monitors and peripherals."},
{"sku": "ACC-003", "name": "PowerBank 26800mAh", "price": 59.99, "quantityOnHand": 600, "description": "High-capacity 26,800mAh portable power bank with 65W USB-C PD output for charging laptops on the go. Charges a typical ultrabook to 50% in about 45 minutes and holds multiple phone charges. A travel-essential accessory for professionals who need reliable mobile power."},
{"sku": "ACC-004", "name": "ScreenGuard Privacy Filter 15\"", "price": 39.99, "quantityOnHand": 800, "description": "15-inch laptop privacy filter that limits screen visibility to a 60-degree viewing angle. Prevents visual eavesdropping in coffee shops, airports, and open-plan offices. Anti-glare matte finish also reduces eye strain from overhead lighting and window reflections."},
{"sku": "ACC-005", "name": "CleanKit Electronics Toolkit", "price": 24.99, "quantityOnHand": 1500, "description": "Complete electronics cleaning kit with microfiber cloths, compressed air, screen cleaner, and precision brushes. Keeps laptops, monitors, keyboards, and peripherals free from dust, fingerprints, and debris. An essential maintenance accessory for extending the life of your tech equipment."},
{"sku": "ACC-006", "name": "WristRest Gel Pad Combo", "price": 29.99, "quantityOnHand": 1000, "description": "Memory foam gel wrist rest set for keyboard and mouse with non-slip rubber base. Reduces pressure on the carpal tunnel during extended typing and mouse use. Ergonomic desk accessory recommended for anyone spending long hours at a computer workstation."},
{"sku": "ACC-007", "name": "BackpackPro Tech Carry", "price": 79.99, "quantityOnHand": 350, "description": "Water-resistant tech backpack with dedicated laptop compartment fitting up to 17-inch devices. Features TSA-friendly lay-flat design and organizer pockets for chargers, cables, and accessories. Built for daily commuters and business travelers who carry a full mobile office."},
{"sku": "ACC-008", "name": "DeskMat XXL Mousepad", "price": 34.99, "quantityOnHand": 800, "description": "Extra-large 36x18 inch desk mat with micro-textured cloth surface and stitched anti-fray edges. Covers the full keyboard and mouse area for a clean, unified workspace aesthetic. Provides smooth tracking surface for optical and laser mice with non-slip rubber backing."},
{"sku": "ACC-009", "name": "CableTidy Velcro Organizer 20-pack", "price": 12.99, "quantityOnHand": 3000, "description": "Pack of 20 reusable velcro cable ties in assorted colors for organizing desk and server cables. Each tie wraps securely and releases without damaging cable jackets. A simple cable management accessory that transforms cluttered setups into neat, organized workspaces."},
{"sku": "ACC-010", "name": "WebcamCover Slider 6-pack", "price": 9.99, "quantityOnHand": 5000, "description": "Ultra-thin 0.7mm webcam privacy cover sliders compatible with laptops, tablets, and external monitors. Blocks camera lens when not in use to prevent unauthorized video access. Installs with residue-free adhesive and slides open smoothly when you need your camera."},
{"sku": "ACC-011", "name": "USB-C Hub Clamp Mount", "price": 54.99, "quantityOnHand": 300, "description": "Desk-clamp USB-C hub with 4 USB-A ports, headphone jack, and SD card slot that mounts to desk edges. Keeps ports accessible at arm's reach without cluttering the desk surface. Space-saving accessory for standing desk setups and minimalist workstation configurations."},
{"sku": "ACC-012", "name": "LaptopLock Security Cable", "price": 34.99, "quantityOnHand": 500, "description": "Keyed security cable lock compatible with Kensington and Nano lock slots for theft prevention. Features a 6-foot braided steel cable that secures laptops in libraries, offices, and shared spaces. A practical security accessory for protecting valuable equipment in public environments."},
{"sku": "DIS-001", "name": "UltraWide 34\" Curved Monitor", "price": 599.99, "quantityOnHand": 150, "description": "34-inch ultrawide curved IPS monitor with 3440x1440 resolution and 100Hz refresh rate. Provides expansive screen real estate for side-by-side document editing and immersive productivity. Features USB-C connectivity with 65W power delivery for single-cable laptop docking."},
{"sku": "DIS-002", "name": "ProColor 27\" 4K Monitor", "price": 499.99, "quantityOnHand": 200, "description": "27-inch 4K UHD IPS monitor factory-calibrated to Delta E less than 2 for professional color accuracy. Covers 99% of sRGB and 95% DCI-P3 color gamut for graphic design and photo editing. Includes a fully adjustable ergonomic stand with pivot, swivel, tilt, and height adjustment."},
{"sku": "DIS-003", "name": "GameVision 27\" 240Hz Monitor", "price": 449.99, "quantityOnHand": 250, "description": "27-inch gaming monitor with 240Hz refresh rate and 1ms GtG response time for competitive esports. Supports AMD FreeSync and NVIDIA G-Sync for tear-free gameplay at high frame rates. Features customizable crosshair overlay and black equalizer for competitive gaming advantages."},
{"sku": "DIS-004", "name": "PortableView 15.6\" USB-C Display", "price": 249.99, "quantityOnHand": 300, "description": "Lightweight 15.6-inch portable USB-C display that adds a second screen to any laptop setup. Draws power directly from the USB-C connection with no external adapter required. Perfect for mobile professionals, remote workers, and digital nomads who need dual-monitor productivity on the road."},
{"sku": "DIS-005", "name": "VerticalDuo 28\" Pivot Monitor", "price": 379.99, "quantityOnHand": 200, "description": "28-inch 4K monitor with 90-degree pivot rotation for vertical code editing and document review. Features a daisy-chain DisplayPort output for multi-monitor setups without extra cables. Ideal for software developers and financial analysts who benefit from tall vertical screen orientation."},
{"sku": "DIS-006", "name": "EyeCare 24\" Anti-Flicker Monitor", "price": 229.99, "quantityOnHand": 400, "description": "24-inch Full HD monitor with flicker-free backlight and hardware low blue light filter for all-day eye comfort. TUV Rheinland certified for reduced eye strain during extended computing sessions. A health-conscious display choice for office workers and students studying for long hours."},
{"sku": "DIS-007", "name": "SignageBoard 43\" Commercial Display", "price": 799.99, "quantityOnHand": 75, "description": "43-inch commercial-grade display with 700-nit brightness and built-in media player for digital signage. Designed for 24/7 operation in retail stores, lobbies, and restaurants with anti-burn-in technology. Supports remote content management over LAN for centralized multi-location signage control."},
{"sku": "DIS-008", "name": "DualMount Monitor Arm Pair", "price": 149.99, "quantityOnHand": 250, "description": "Dual-monitor desk mount arm supporting two displays up to 32 inches with full articulation. Gas-spring mechanism enables effortless height, tilt, and swivel adjustment for perfect ergonomic positioning. Frees up desk space and creates a clean, professional dual-display workstation setup."},
{"sku": "DIS-009", "name": "TouchScreen 21.5\" Interactive Display", "price": 349.99, "quantityOnHand": 150, "description": "21.5-inch 10-point multi-touch interactive display for point-of-sale, kiosk, and collaborative applications. Features an anti-fingerprint coating and industrial-grade touch panel rated for 50 million touches. Versatile interactive display solution for retail checkout, reception desks, and classroom annotation."},
{"sku": "DIS-010", "name": "MiniLED 32\" HDR Creator Monitor", "price": 899.99, "quantityOnHand": 100, "description": "32-inch mini-LED display with 1,152 local dimming zones and DisplayHDR 1000 certification for stunning contrast. Delivers true-to-life HDR content preview for video editors and colorists working in HDR workflows. Combines professional color accuracy with high dynamic range for the ultimate creator display."},
{"sku": "FUR-001", "name": "StandDesk Pro Electric", "price": 699.99, "quantityOnHand": 100, "description": "Electric sit-stand desk with dual-motor height adjustment and programmable memory presets. Supports up to 350 pounds with a spacious 60x30 inch bamboo desktop surface. Promotes healthier work habits by enabling seamless transitions between sitting and standing throughout the day."},
{"sku": "FUR-002", "name": "ErgoChair Mesh Executive", "price": 549.99, "quantityOnHand": 120, "description": "Ergonomic mesh office chair with adjustable lumbar support, headrest, and 4D armrests. Breathable mesh back keeps you cool during long work sessions with weight-responsive recline. Engineered for 8+ hours of seated comfort with a 12-year warranty and BIFMA certification."},
{"sku": "FUR-003", "name": "ServerRack 42U Cabinet", "price": 899.99, "quantityOnHand": 50, "description": "42U server rack cabinet with locking front and rear doors, side panels, and integrated cable management. Features adjustable mounting rails and 4 built-in cooling fans with thermostat control. Essential office furniture for IT departments housing networking equipment, servers, and UPS systems."},
{"sku": "FUR-004", "name": "CableTrack Under-Desk Tray", "price": 39.99, "quantityOnHand": 500, "description": "Under-desk cable management tray that hides power strips, adapters, and excess cable length. Mounts with no-drill clamp attachment and accommodates standing desk height changes. A clean workspace furniture accessory that eliminates visible cable clutter from the floor and desktop."},
{"sku": "FUR-005", "name": "MonitorShelf Desktop Riser", "price": 59.99, "quantityOnHand": 350, "description": "Bamboo desktop monitor riser with storage shelf for keyboard, notebooks, and accessories underneath. Elevates displays to a comfortable viewing height while reclaiming valuable desk real estate. A simple furniture addition that improves both ergonomics and desk organization simultaneously."},
{"sku": "FUR-006", "name": "FootRest Adjustable Rocker", "price": 44.99, "quantityOnHand": 400, "description": "Ergonomic under-desk footrest with textured rocking surface and adjustable tilt angle. Promotes circulation and reduces lower back pressure during extended seated work periods. Compact office furniture accessory that pairs with any desk chair for improved seated posture."},
{"sku": "FUR-007", "name": "AcousticPanel Desk Divider", "price": 129.99, "quantityOnHand": 200, "description": "Sound-absorbing desk divider panel made from recycled PET felt that reduces ambient office noise. Clamps to desk edges with adjustable height for privacy in open-plan workspaces. Functional office furniture that creates visual and acoustic boundaries between adjacent workstations."},
{"sku": "FUR-008", "name": "WhiteBoard Mobile Stand 48x36", "price": 179.99, "quantityOnHand": 100, "description": "Mobile whiteboard stand with double-sided 48x36 inch magnetic dry-erase surface on locking casters. Height-adjustable with integrated marker tray and eraser holder for brainstorming sessions. Collaborative office furniture for meeting rooms, classrooms, and agile development team areas."},
{"sku": "FUR-009", "name": "DeskLamp LED Task Light", "price": 69.99, "quantityOnHand": 600, "description": "LED desk lamp with adjustable color temperature from warm 2700K to daylight 6500K and brightness dimming. Features a swing arm with clamp mount that saves desk space and reduces eye strain. Energy-efficient workspace lighting designed for focused task work, reading, and detailed assembly."},
{"sku": "FUR-010", "name": "DrawerUnit Mobile Pedestal", "price": 149.99, "quantityOnHand": 200, "description": "3-drawer mobile pedestal with locking file drawer on smooth-rolling casters for under-desk storage. Fits standard letter and legal size hanging folders with a cushioned seat top for guest seating. Versatile office furniture piece that provides secure document storage and extra seating in one unit."},
{"sku": "FUR-011", "name": "StandingMat Anti-Fatigue", "price": 79.99, "quantityOnHand": 300, "description": "Premium anti-fatigue standing desk mat with beveled edges and multi-terrain textured surface. Encourages subtle foot movement and weight shifting to reduce fatigue during standing work periods. Made from non-toxic PU foam that provides all-day cushioning on hard office floors."},
{"sku": "FUR-012", "name": "PrivacyPod Phone Booth", "price": 2499.99, "quantityOnHand": 50, "description": "Freestanding acoustic phone booth pod with ventilation, LED lighting, and integrated power outlets. Provides a private space for phone calls, video meetings, and focused work in open offices. Modular office furniture solution that installs without construction and can be relocated as floor plans change."},
{"sku": "LAP-013", "name": "StudioBook ProArt 16", "price": 2799.99, "quantityOnHand": 85, "description": "Professional content creation laptop with ASUS dial control and certified Pantone color accuracy. Features a 16-inch 3.2K OLED HDR display with 120Hz refresh for smooth creative workflows. Equipped with Intel Core i9 and NVIDIA RTX GPU for demanding 3D modeling, animation, and compositing tasks."},
{"sku": "PER-013", "name": "PresenterPro Wireless Clicker", "price": 44.99, "quantityOnHand": 500, "description": "Wireless presentation clicker with laser pointer, slide navigation, and timer with vibration alerts. Works with PowerPoint, Keynote, and Google Slides over a reliable 2.4GHz RF connection. A compact presentation peripheral that fits in your pocket for confident delivery at meetings and conferences."},
{"sku": "STO-012", "name": "DualDock Clone Station", "price": 59.99, "quantityOnHand": 350, "description": "Dual-bay hard drive docking station with offline cloning function for SATA and NVMe drives. Enables quick drive duplication without a computer for IT deployment and disk migration tasks. Versatile storage accessory that doubles as an external drive reader with USB 3.2 Gen 2 speeds."},
{"sku": "NET-012", "name": "USB-C Ethernet Adapter 2.5GbE", "price": 34.99, "quantityOnHand": 800, "description": "USB-C to 2.5GbE Ethernet adapter for adding wired network connectivity to modern ultrabooks and tablets. Delivers faster-than-gigabit wired speeds without occupying a PCIe slot or requiring driver installation. A pocket-sized networking accessory for professionals who need reliable low-latency connections."},
{"sku": "AUD-012", "name": "SoundIsolation Foam Kit 24-pack", "price": 89.99, "quantityOnHand": 300, "description": "Pack of 24 acoustic foam panels with wedge profile for reducing echo and reverb in recording spaces. Self-adhesive backing enables tool-free installation on walls and ceilings of home studios. Essential audio treatment for podcasters, musicians, and voice actors who need clean, professional sound recordings."},
{"sku": "DIS-011", "name": "ColorProof 27\" Reference Monitor", "price": 1299.99, "quantityOnHand": 60, "description": "27-inch hardware-calibrated reference monitor with built-in colorimeter and 10-bit IPS panel. Covers 99% Adobe RGB and 98% DCI-P3 for color-critical photography and prepress workflows. Includes a lens hood and factory calibration report for out-of-box accuracy in professional display environments."},
{"sku": "DIS-012", "name": "NanoEdge 24\" Bezel-Free Kit", "price": 169.99, "quantityOnHand": 300, "description": "Pair of optical bezel-free display panels that visually eliminate bezels between adjacent monitors. Uses precision-ground prisms to create a seamless multi-monitor experience for immersive gaming and trading. An innovative display accessory that transforms dual or triple monitor setups into a virtual ultrawide."},
{"sku": "ACC-013", "name": "AirTag Wallet Card Tracker", "price": 29.99, "quantityOnHand": 1000, "description": "Credit-card-sized Bluetooth tracker that fits in wallets, laptop bags, and equipment cases. Works with Find My network for global location tracking of valuable tech gear and accessories. A thin, rechargeable tracking accessory that provides peace of mind for frequently misplaced items."},
{"sku": "FUR-013", "name": "BalanceBoard Standing Desk", "price": 99.99, "quantityOnHand": 200, "description": "Wooden balance board designed for use with standing desks to engage core muscles while working. Features a non-slip deck surface and smooth rocker rail for gentle side-to-side movement. Active standing furniture accessory that combats the fatigue and monotony of static standing posture."}
]
